Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad class.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.CSCode
Gets or sets the CS code of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.StartDistance
Gets or sets the start distance of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.EndDistance
Gets or sets the end distance of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.StartValue
Gets or sets the start value of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.EndValue
Gets or sets the end value of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.Select
Selects the analysis decomposed member load.